import { v1 as uuid } from 'uuid';

export const periods = [
  {
    name: 'Литература',
    start: 1992,
    end: 1997,
    dates: [
      {
        id: uuid(),
        year: 1992,
        description:
          'Нобелевская премия по литературе - Дерек Уолкотт, " За блестящий образец карбского эпоса в 64 разделах".',
      },
      {
        id: uuid(),
        year: 1994,
        description: '" Бессонница" - роман Стивена Кинга.',
      },
      {
        id: uuid(),
        year: 1995,
        description: 'Нобелевская премия по литературе - Шеймас Хини',
      },
      {
        id: uuid(),
        year: 1997,
        description: 'Старт космического аппарата',
      },
    ],
  },
  {
    name: 'Литература',
    start: 1987,
    end: 1991,
    dates: [
      {
        id: uuid(),
        year: 1992,
        description:
          '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        id: uuid(),
        year: 1993,
        description:
          'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
      },
      {
        id: uuid(),
        year: 1997,
        description:
          'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
      },
      {
        id: uuid(),
        year: 1997,
        description: 'Старт космического аппарата',
      },
    ],
  },
  {
    name: 'Кино',
    start: 1999,
    end: 2004,
    dates: [
      {
        id: uuid(),
        year: 2000,
        description:
          '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        id: uuid(),
        year: 2001,
        description:
          'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
      },
      {
        id: uuid(),
        year: 2002,
        description:
          'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
      },
      {
        id: uuid(),
        year: 2003,
        description: 'Старт космического аппарата',
      },
    ],
  },
  {
    name: 'Кино',
    start: 2000,
    end: 2002,
    dates: [
      {
        id: uuid(),
        year: 2000,
        description:
          '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        id: uuid(),
        year: 2001,
        description:
          'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
      },
      {
        id: uuid(),
        year: 2002,
        description:
          'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
      },
      {
        id: uuid(),
        year: 2003,
        description: 'Старт космического аппарата',
      },
    ],
  },
  {
    name: 'Кино',
    start: 2000,
    end: 2002,
    dates: [
      {
        id: uuid(),
        year: 2000,
        description:
          '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        id: uuid(),
        year: 2001,

        description:
          'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
      },
      {
        id: uuid(),
        year: 2002,
        description:
          'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
      },
      {
        id: uuid(),
        year: 2003,
        description: 'Старт космического аппарата',
      },
    ],
  },
  {
    name: 'Кино',
    start: 2015,
    end: 2022,
    dates: [
      {
        id: uuid(),
        year: 2000,
        description:
          '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        id: uuid(),
        year: 2001,
        description:
          'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
      },
      {
        id: uuid(),
        year: 2002,
        description:
          'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
      },
      {
        id: uuid(),
        year: 2003,
        description: 'Старт космического аппарата',
      },
    ],
  },
];
